## Importing numpy and pandas libraries

In [34]:
import numpy as np
import pandas as pd

## Importing numpy and pandas libraries

In [35]:
import matplotlib.pyplot as plt
import seaborn as sns

## Importing warnings to ignore

In [36]:
import warnings
warnings.filterwarnings('ignore')

## Importing Data from CSV

In [81]:
df_2018 = pd.read_csv('IT Salary Survey EU 2018.csv')
df_2018

,Timestamp,Age,Gender,City,Position,Years of experience,Your level,Current Salary,Salary one year ago,Salary two years ago,Are you getting any Stock Options?,Main language at work,Company size,Company type
0,14/12/2018 12:41:33,43.0,M,München,QA Ingenieur,11.0,Senior,77000.0,76200.0,68000.0,No,Deutsch,100-1000,Product
1,14/12/2018 12:42:09,33.0,F,München,Senior PHP Magento developer,8.0,Senior,65000.0,55000.0,55000.0,No,Deutsch,50-100,Product
2,14/12/2018 12:47:36,32.0,M,München,Software Engineer,10.0,Senior,88000.0,73000.0,54000.0,No,Deutsch,1000+,Product
3,14/12/2018 12:50:15,25.0,M,München,Senior Frontend Developer,6.0,Senior,78000.0,55000.0,45000.0,Yes,English,1000+,Product
4,14/12/2018 12:50:31,39.0,M,München,UX Designer,10.0,Senior,69000.0,60000.0,52000.0,No,English,100-1000,Ecom retailer
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
760,03/06/2020 20:12:51,40.0,M,Köln,Java Developer junior,1.0,Junior,44000.0,40000.0,40000.0,Yes,Deutsch,10-50,Product
761,28/07/2020 04:03:13,NaN,M,Köln,E.g. C# Developer,1.0,Junior,45000.0,40000.0,40000.0,Yes,Deutsch,10-50,Product
762,28/07/2020 04:03:20,NaN,M,Köln,E.g. C# Developer,1.0,Junior,45000.0,40000.0,40000.0,Yes,Deutsch,10-50,Product
763,26/08/2020 09:06:44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
764,21/09/2020 01:47:10,31.0,F,München,Pm,10.0,Senior,110000.0,NaN,NaN,No,English,1000+,Product

## Inspecting Dataframe

In [82]:
df_2018.head()

,Timestamp,Age,Gender,City,Position,Years of experience,Your level,Current Salary,Salary one year ago,Salary two years ago,Are you getting any Stock Options?,Main language at work,Company size,Company type
0,14/12/2018 12:41:33,43.0,M,München,QA Ingenieur,11.0,Senior,77000.0,76200.0,68000.0,No,Deutsch,100-1000,Product
1,14/12/2018 12:42:09,33.0,F,München,Senior PHP Magento developer,8.0,Senior,65000.0,55000.0,55000.0,No,Deutsch,50-100,Product
2,14/12/2018 12:47:36,32.0,M,München,Software Engineer,10.0,Senior,88000.0,73000.0,54000.0,No,Deutsch,1000+,Product
3,14/12/2018 12:50:15,25.0,M,München,Senior Frontend Developer,6.0,Senior,78000.0,55000.0,45000.0,Yes,English,1000+,Product
4,14/12/2018 12:50:31,39.0,M,München,UX Designer,10.0,Senior,69000.0,60000.0,52000.0,No,English,100-1000,Ecom retailer

In [83]:
df_2018.shape

(765, 14)

In [84]:
df_2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 765 entries, 0 to 764
Data columns (total 14 columns):
 #   Column                              Non-Null Count  Dtype
---  ------                              --------------  -----
 0   Timestamp                           765 non-null    object
 1   Age                                 672 non-null    float64
 2   Gender                              751 non-null    object
 3   City                                736 non-null    object
 4   Position                            737 non-null    object
 5   Years of experience                 732 non-null    float64
 6   Your level                          743 non-null    object
 7   Current Salary                      750 non-null    float64
 8   Salary one year ago                 596 non-null    float64
 9   Salary two years ago                463 non-null    float64
 10  Are you getting any Stock Options?  742 non-null    object
 11  Main language at work               750 non-null    object
 12  Company size                        750 non-null    object
 13  Company type                        730 non-null    object
dtypes: float64(5), object(9)
memory usage: 83.8+ KB

In [85]:
df_2018.describe()

,Age,Years of experience,Current Salary,Salary one year ago,Salary two years ago
count,672.000000,732.000000,750.000000,596.000000,463.000000
mean,32.183036,8.548497,68381.765333,62187.278523,58013.475162
std,5.107268,4.729557,21196.306557,20163.008663,20413.048908
min,21.000000,0.000000,10300.000000,10001.000000,10001.000000
25%,29.000000,5.000000,57000.000000,52000.000000,48000.000000
50%,32.000000,8.000000,65000.000000,60000.000000,56000.000000
75%,35.000000,11.000000,75000.000000,70000.000000,67000.000000
max,60.000000,38.000000,200000.000000,200000.000000,150000.000000

In [86]:
df_2018.nunique()

Timestamp                             761
Age                                    33
Gender                                  2
City                                   74
Position                              397
Years of experience                    30
Your level                              3
Current Salary                        139
Salary one year ago                   125
Salary two years ago                  105
Are you getting any Stock Options?      2
Main language at work                   7
Company size                            5
Company type                           49
dtype: int64

In [87]:
df_2018.isnull().sum()

Timestamp                               0
Age                                    93
Gender                                 14
City                                   29
Position                               28
Years of experience                    33
Your level                             22
Current Salary                         15
Salary one year ago                   169
Salary two years ago                  302
Are you getting any Stock Options?     23
Main language at work                  15
Company size                           15
Company type                           35
dtype: int64

### Salary 1 year ago and 2 year ago are missing for people
#### Possible as they might have joined in the recent two years

### Few values are missing for almost every column we will see what we can do about them

## Lets work on every column to eliminate the null values

## Company size
Dropping comapnay size null values as we can see many columns has missing values >= 15 so it is possible that those 15 rows are null for all these columns

In [88]:
df_2018.dropna(subset = ['Company size'], inplace = True)

In [89]:
df_2018.isnull().sum()

Timestamp                               0
Age                                    79
Gender                                  3
City                                   18
Position                               14
Years of experience                    19
Your level                              9
Current Salary                          2
Salary one year ago                   155
Salary two years ago                  288
Are you getting any Stock Options?      9
Main language at work                   1
Company size                            0
Company type                           21
dtype: int64

In [90]:
# our hypothesis was correct as few null datas has dropped from each columns

In [91]:
df_2018.shape

(750, 14)

## Gender, Current Salary, Main language at work

In [92]:
#calculate the percentage of missing values in age column.
(3/750)*100

0.4

In [93]:
# since it is so low we can drop these values
df_2018.dropna(subset = ['Gender', 'Current Salary', 'Main language at work', 'Your level'], inplace = True)

In [94]:
df_2018.isnull().sum()

Timestamp                               0
Age                                    77
Gender                                  0
City                                   18
Position                               12
Years of experience                    17
Your level                              0
Current Salary                          0
Salary one year ago                   150
Salary two years ago                  281
Are you getting any Stock Options?      9
Main language at work                   0
Company size                            0
Company type                           21
dtype: int64

In [95]:
df_2018.shape

(735, 14)

In [22]:
mean = df_2018['Age'].median()
mean

32.0

In [23]:
df_2018['Age'].fillna(mean, inplace = True)

In [27]:
df_2018.isnull().sum()

Timestamp                               0
Age                                     0
Gender                                 14
City                                   29
Position                               28
Years of experience                    33
Your level                             22
Current Salary                         15
Salary one year ago                   169
Salary two years ago                  302
Are you getting any Stock Options?     23
Main language at work                  15
Company size                           15
Company type                           35
dtype: int64

In [33]:
df_2018.dropna(subset = ['Company size'], inplace = True)

In [31]:
# now we will see our hypothesis of 

df_2018.isnull().sum()

Timestamp                               0
Age                                     0
Gender                                  3
City                                   18
Position                               14
Years of experience                    19
Your level                              9
Current Salary                          2
Salary one year ago                   155
Salary two years ago                  288
Are you getting any Stock Options?      9
Main language at work                   1
Company size                            0
Company type                           21
dtype: int64

In [32]:
df_2018.shape

(750, 14)